/****************************************************
██████╗ ██████╗ ██╗   ██╗████████╗███████╗███╗   ██╗
██╔══██╗██╔══██╗██║   ██║╚══██╔══╝██╔════╝████╗  ██║
██████╔╝██████╔╝██║   ██║   ██║   █████╗  ██╔██╗ ██║
██╔══██╗██╔══██╗██║   ██║   ██║   ██╔══╝  ██║╚██╗██║
██████╔╝██║  ██║╚██████╔╝   ██║   ███████╗██║ ╚████║
╚═════╝ ╚═╝  ╚═╝ ╚═════╝    ╚═╝   ╚══════╝╚═╝  ╚═══╝
***************************************************/
#include <bits/stdc++.h>
using namespace std;
#define ll long long

int main()
{
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    ll t;
    cin >> t;

    while (t--)
    {
        ll n, k;
        cin >> n >> k;
        vector<ll> vec1(n), vec2(n);
        for (int i = 0; i < n; i++)
            cin >> vec1[i];
        for (int i = 0; i < n; i++)
            cin >> vec2[i];

        vector<ll> vec3 = vec2;
        sort(vec3.begin(), vec3.end());
        bool dup = false;
        for (int i = 0; i < n - 1; i++)
        {
            if (vec3[i] != -1 && (vec3[i] == vec3[i + 1]))
            {
                dup = true;
                break;
            }
        }

        if (dup)
        {
            cout << "NO\n";
            continue;
        }

        if (k == n)
        {
            cout << "YES" << '\n';
            continue;
        }

        int st = k - 1, ed = n - k;
        bool psbl = true;
        for (int i = 0; i < n; i++)
        {
            if (i >= ed && i <= st)
                continue;
            if (vec2[i] == -1)
                continue;
            if (vec1[i] != vec2[i])
            {
                psbl = false;
                // cout << i << '\n';
                break;
            }
        }
        map<ll, ll> fq;
        for (int i = ed; i <= st; i++)
        {
            fq[vec1[i]]++;
        }

        for (int i = ed; i <= st; i++)
        {
            if (vec2[i] != -1 && fq[vec2[i]] == 0)
            {
                psbl = false;
                break;
            }
        }

        if (psbl)
            cout << "YES" << '\n';
        else
            cout << "NO" << '\n';
    }
    return 0;
}
